<div id="body">
<link rel="stylesheet" href="./css/style.css">

 <div class="blok2"><p>На данном сайте студентам предоставлен курс обучения по диспциплине «Математические методы». Все темы курса предоставлены в виде четырех разделов. Для получения оценки по окончанию курса студенты должны изучить теоретический материал, выполнить лабораторные работы, а также самостоятельные работы, 
 которые будут прикреплены к теоретическому материалу.</p><img src="./img/hat.svg" width="50" height="50"></div>
</form>
</div>