<div id="section">
<link rel="stylesheet" href="css/style.css">
 <div class="blok4"> <p align=center>1 раздел</p>
        <hr>
        <ul >
         <li><a href="./vvedenie.php">Тема 1.1. Введение. Моделирование как метод познания.</a></li>
         <li><a href="./lr2.html">Тема 1.2. Этапы построения математической модели задачи. Математическое программирование.</a></li>
        </ul>
        <p align="center">2 раздел</p>
        <hr>
        <ul >
         <li><a href="./tema21.html">Тема 2.1. Постановка задачи линейного программирования. Графический метод решения ЗЛП.</a></li>
         <li><a href="./tema22.html">Тема 2.2. Симплекс метод решения задач линейного программирования.</a></li>
         <li><a href="./tema23.html">Тема 2.3. Целочисленное программирование.</a></li>
         <li><a href="./tema24.html">Тема 2.4. Транспортная задача линейного программирования.</a></li>
        </ul>
        <p align="center">3 раздел</p>
        <hr>
        <ul >
         <li><a href="./tema31.html">Тема 3.1. Технология имитационного моделирования.</a></li>
        </ul>
        <p align="center">4 раздел</p>
        <hr>
        <ul >
         <li><a href="./tema41.html">Тема 4.1. Понятие прогноза. Количественные методы прогнозирования.</a></li>
        </ul></div>
  </div>
