<!DOCTYPE html>
<html lang="ru">
<head>
<title>Математические методы</title>
        <meta charset="UTF-8">
        <style>
<?php echo file_get_contents("css/style1.css"); ?>
</style>

</head>
<body>

  <div id="glaw">
    <div class="blok1"><p>Тема 1.1. Введение. Моделирование как метод познания.</p></div>
    <div class="blok2"><p align="center"><b>Введение</b>
    <p>Сложный характер теоретических и практических задач современной рыночной экономики требует использования математических методов в экономических исследованиях. Проблемы, с которыми сталкиваются специалисты в различных областях экономики, зависят от множества различных, противоречивых факторов, меняющихся со временем и влияющих на другие проблемы и процессы.
<p>В последнее время математическое моделирование является одним из важнейших методов изучения и анализа экономических объектов и процессов и прогнозирования их развития. Важность использования математических методов в анализе экономических проблем подчеркивается тем, что Нобелевские премии в области экономики получают в основном за успехи в экономико-математическом моделировании.</p>
<p>Экономико-математическое моделирование – это один из эффективных методов описания сложных социально-экономических систем и процессов.</p>
<p>Математические модели отображают экономические проблемы в абстрактной форме и позволяют учесть большое число различных характеристик исследуемых проблем.</p>
<p>Экономико-математическое моделирование призвано помочь руководителям различного ранга в выработке, обосновании и принятии эффективных, качественных решений в области экономики, организации производства и управления, в инвестиционном проектировании и в финансовой сфере. Это должно повысить надежность функционирования производственно-экономических систем.</p>
<p>Квалифицированные специалисты в различных областях экономической деятельности должны обладать обширными познаниями в сфере экономико-математического моделирования для решения задач оптимального распределения органических ресурсов; выработки эффективных решений в условиях неопределенности, противоречивости ограничений; анализа производственно-экономической информации и прогнозирования развития исследуемых процессов на основе современных компьютерных технологий.</p>
</p>
     <p><p align="center"><b>Моделирование как метод познания</b></p>
       <p>Модели и моделирование используются человечеством давно. По сути, именно модели и модельные отношения обусловили появление разговорных языков, письменности, графики. Наскальные изображения наших предков, затем картины и книги — это модельные, информационные формы передачи знаний об окружающем мире последующим поколениям.
Попробуем разобраться в том, что такое модель.
Казалось бы, что общего между игрушечным корабликом и рисунком на экране компьютера, изображающим сложную математическую абстракцию? И все же общее есть: и в том, и в другом случае мы имеем образ реального объекта, представляющий собой «заместитель» некоторого оригинала, воспроизводящий оригинал с той или иной степенью достоверности или детализации. Другими словами: <i>модель является представлением объекта в некоторой форме, отличной от формы его реального существования.</i>
</p>
<p>Практически во всех науках о природе (живой и неживой) и обществе построение и использование моделей являются мощным орудием познания. Реальные объекты и процессы бывают столь многогранны и сложны, что лучшим способом их изучения является такой: построить модель, отображающую лишь какую-то грань реальности и потому несравнимо более простую, чем эта реальность, и исследовать сначала эту модель. Многовековой опыт развития науки доказал на практике плодотворность такого подхода. Модель — неоценимый и бесспорный помощник инженеров и ученых.</p>
<p>Приведем несколько примеров, поясняющих, что такое модель.</p>
<p>Архитектор готовится построить здание невиданного доселе типа. Но прежде чем воздвигнуть его, он сооружает это здание из кубиков на столе, чтобы посмотреть, как оно будет выглядеть. Это <i>модель здания.</i></p>
<p>Для того чтобы объяснить, как функционирует система кровообращения, лектор демонстрирует плакат со схемой, на которой стрелочками изображены направления движения крови. Это <i>модель функционирования системы кровообращения.</i></p>
<p>На стене висит картина, изображающая яблоневый сад в цвету. Это <i>модель яблоневого сада.</i></p>
<p>Во всех перечисленных примерах имеет место сопоставление некоторого объекта с другим, его заменяющим: реальное здание — постройка из кубиков; система кровообращения — схема на плакате; яблоневый сад — картина, его изображающая.</p>
<p align="center">Итак, дадим следующее определение модели:</p>
<p><b>Модель</b> — это такой материальный или мысленно представляемый объект, который в процессе изучения замещает объект-оригинал, сохраняя некоторые важные для данного исследования типичные черты этого оригинала.</p>
<p>Или можно сказать другими словами: </p>
<p><b>Модель</b> — это упрощенное представление о реальном объекте, 
процессе или явлении
</p>
<p>Модель позволяет научиться правильно управлять объектом посредством апробации различных вариантов управления на модели этого объекта. Экспериментировать в этих целях с реальным объектом в лучшем случае бывает неудобно, а как правило, просто вредно или вообще невозможно в силу ряда причин (большой про¬должительности эксперимента во времени, риска привести объект в нежелательное и необратимое состояние и т. п.)</p>
<ul>Итак, сделаем выводы: модель необходима, для того чтобы:</ul>
<li>понять, как устроен конкретный объект — каковы его структура, основные свойства, законы развития и взаимодействия с окружающим миром;</li>
<li>научиться управлять объектом или процессом и определять наилучшие способы управления при заданных целях и критериях (оптимизация);</li>
<li>прогнозировать прямые и косвенные последствия реализации заданных спосо¬бов и форм воздействия на объект.</li>
</p>
<p><b>Моделированием</b> называется как процесс построения модели, так и процесс изучения строения и свойств оригинала с помощью построенной модели.</p>
<p>Технология моделирования требует от исследователя умения определять проблемы и ставить задачи, прогнозировать результаты исследования, проводить разумные оценки, выделять главные и второстепенные факторы для построения моделей, выбирать аналогии и математические формулировки, решать задачи с использованием компьютерных систем, проводить анализ компьютерных экспериментов.</p>
<p>Навыки моделирования очень важны для человека в его повседневной деятельности. Они помогают разумно планировать распорядок дня, учебу, труд, выбирать оптимальные варианты при наличии выбора, удачно разрешать различные жизненные проблемы.</p>
<p align="center"><b>Виды моделирования</b></p>
<p align="center"><img src="./img/vid.png" ></p>
<p><b>Материальным (предметным, физическим)</b> принято называть моделирование, при котором реальному объекту сопоставляется его увеличенная или уменьшенная копия, допускающая исследование (как правило, в лабораторных условиях) с помощью последующего перенесения свойств изучаемых процессов и явлений с модели на объект на основе теории подобия.
<br><b>Примеры:</b> в астрономии — планетарий, в архитектуре — макеты зданий, в самолетостроении — модели летательных аппаратов.
</p>
<p>От материального моделирования принципиально отличается <b>идеальное моделирование</b>, которое основано не на материальной аналогии объекта и модели, а на идеальной, мыслительной.</p>
<p><b>Знаковое моделирование</b> — моделирование, использующее в качестве моделей знаковые преобразования какого-либо вида: схемы, графики, чертежи, формулы, наборы символов.</p>
<p><b>Математическое моделирование</b> — моделирование, при котором исследование объекта осуществляется посредством модели, описанной на языке математики. <br> <b>Пример:</b> описание и исследование законов механики Ньютона средствами математических формул.</p>
<p><b>Процесс моделирования</b> можно представить в виде последовательности нескольких этапов:</p>
<p align="center"><b>объект &#8594; модель &#8594; изучение модели 	&#8658;   знания об объекте.</b></p>
<p align="center"><b>Классификация моделей. Материальные и информационные модели</b></p>
<p>Классификацию моделей можно проводить в соответствии с различными их признаками.</p>
<p><ul><u>1. По   области   использования:</u></ul>
<li>учебные — наглядные пособия, обучающие программы, различные тренажеры;</li>
<li>опытные — модель корабля (испытывается в бассейне для определения устойчивости судна при качке);</li>
<li>научно-технические — ускоритель электронов; прибор, имитирующий разряд молнии; стенд для проверки телевизора;</li>
<li>игровые — военные, экономические, спортивные, деловые и другие игры;</li>
<li>имитационные — эксперимент или многократно повторяется для изучения и оценки влияния каких-либо действий на реальную обстановку, или проводится одновременно со многими объектами, похожими, но поставленными в разные условия.</li>
</p>
<p align="center"><b>Классификация моделей по области использования</b></p>
<p align="center"><img src="./img/klass.png" width="65%"></p>
<p><ul><u>2. По  учету   фактора   времени:</u></ul>
<li>статические — дают «одномоментный срез» текущего состояния объекта. Пример. Школьник пришел в стоматологическую поликлинику для осмотра полости рта. Врач провел осмотр и сделал записи в медицинской карте. Эти записи, дающие картину состояния ротовой полости на данный момент времени (число молочных, постоянных, пломбированных, удаленных зубов), и будут являться статической моделью;</li>
<li>динамические — позволяют увидеть изменения объекта во времени. 
<br><b>Пример: </b>та же самая медицинская карта школьника, которая отражает изменения, происходящие с его зубами за определенный промежуток времени.</li>
</p>
<p align="center"><b>Классификация моделей по учету фактора времени</b></p>
<p align="center"><img src="./img/vremya.png" width="50%"></p>
<p><ul><u>3. По   способу   представления   объекта:</u></ul>
<li>материальные;</li>
<li>информационные.</li>
</p>
<p><b>Материальные</b>  (предметные, физические) модели воспроизводят геометрические и физические свойства оригинала и всегда имеют реальное воплощение.</p>
<p><b>Примеры:</b>
Детские игрушки. По ним ребенок получает первое впечатление об окружающем мире. Двухлетний ребенок играет с плюшевым медвежонком, а когда спустя годы видит в зоопарке настоящего медведя, без труда узнает его.
<br>Школьные пособия, физические и химические опыты. В них моделируются процессы, например реакция между водородом и кислородом. Такой опыт сопровождается оглушительным хлопком. Модель подтверждает утверждение о возникновении «гремучей смеси» из безобидных и широко распространенных в природе веществ.
</p>
<p>Вывод: материальные модели реализуют материальный (потрогать, понюхать, увидеть, услышать) подход к изучению объекта, явления или процесса.</p>
<p>Информационные модели нельзя потрогать или увидеть воочию, они не имеют материального воплощения.</p>
<p><b>Информационная модель</b> — совокупность информации, характеризующая свойства и состояния объекта, процесса, явления, а также его взаимосвязь с внешним миром.</p>
<p>Информация, характеризующая объект или процесс, может иметь разный объем и форму представления, выражаться различными средствами. Это многообразие настолько безгранично, насколько велики возможности каждого человека и его фантазии.</p>
<p>К информационным моделям можно отнести <u>знаковые</u> и  <u>вербальные модели.</u></p>
<p><i>Знаковая модель</i> — информационная модель, выраженная специальными знаками, т. е. средствами любого формального языка.</p>
<p>Знаковые модели окружают нас повсюду. Это рисунки, тексты, графики и схемы.
<br>
По способу реализации знаковые модели можно разделить на компью¬терные и некомпьютерные.
</p>
<p><i>Вербальная</i> (от лат «verbalis» — устный) модель — информационная модель в мысленной или разговорной форме.</p>
<p>Это модели, полученные в результате раздумий, умозаключений. Они могут так и остаться мысленными или быть выражены словесно. Примером такой модели может стать наше поведение при переходе улицы. Человек анализирует ситуацию на дороге (какой сигнал светофора горит, с какой скоростью и на каком расстоянии движутся автомобили и т. п.) и вырабатывает свою модель поведения. Если ситуация смоделирована удачно, то переход будет безопасным, если нет — может произойти авария. К подобным моделям можно отнести идею, возникшую в голове изобретателя; музыкальную тему, промелькнувшую в голове композитора; рифму, родившуюся в голове поэта.</p>
<p>Знаковые и вербальные модели, как правило, взаимосвязаны. Мысленный образ, родившийся в мозгу человека, может быть облечен в знаковую форму. И наоборот, знаковая модель помогает сформировать в сознании верный мысленный образ.</p>
<p align="center"><img src="./img/predst.png"></p>
<p><b>Примеры:</b>
Согласно легенде, яблоко, упавшее на голову Ньютону, вызвало в его сознании мысль о земном притяжении. И только впоследствии эта мысль оформилась в закон, т. е. обрела знаковую форму.
<br>
Человек прочитал текст, объясняющий некоторые физические явления, и у него сформировался мысленный образ. В дальнейшем такой образ поможет распознать реальное явление.
</p>
<p align="center"><b>Классификация моделей по способу представления объекта</b></p>
<p><ul><u>4. По   отрасли   знания:</u></ul>
<li>биологические;</li>
<li>исторические;</li>
<li>социологические и др.</li>
</p>

<hr width="80%" noshade size="1%" color="black">
<p align="center"><b>Контрольные вопросы и задания</b></p>
<p><ol>
<li>Дайте определение модели.</li>
<li>По каким признакам можно классифицировать модели?</li>
<li>Чем отличаются статические модели от динамических?</li>
<li>Приведите примеры статических и динамических моделей.</li>
<li>Что такое материальная, информационная, вербальная и знаковая модели?</li>
<li>Заполните таблицу, которая представлена на 2 слайде презентации.</li>
<p align="center"><a href="./modal.pdf" class="floating-button">Презентация</a></p>
</ol></p>


      
   
      </div>
    
     
  
<div class="blok6">  <div class="layer">
  <p align="center"><b>Самостоятельная работа</b></p>
  <p>Чтобы закрепить теоретический материал студент должные выучить основные понятия, которые даны ниже.</p>
<p>Основные понятия: решение, множество возможных решений, оптимальное решение, показатель эффективности.</p>
<p><div class="container">
  <div style="text-align: center;">
    <a href="#openModal"  class="floating-button">Пройти тест</a>
  </div>
  <div id="openModal" class="modal">
    <div class="modal-dialog">
      <div class="modal-content">
        <div class="modal-header">
         
          <a href="#close" title="Close" class="close">×</a>
        </div>
        <div class="modal-body">
          <script type="text/javascript" language="JavaScript">// <![CDATA[
            var res="1211"; 
           function check_me()
           {
               var count=0;
               with(document.test) {
           if (!Q1[0].checked&&!Q1[1].checked)  
           {count+=1};  
           if (!Q2[0].checked&&!Q2[1].checked)  
           {count+=1};  
           if (!Q3[0].checked&&!Q3[1].checked)  
           {count+=1};  
           if (!Q4[0].checked&&!Q4[1].checked)  
           {count+=1};  
           if (count>0) alert("Вы выполнили не все задания. Проверьте себя!")    
                   else answer();
               }
           } 
            
           function control(k, f1,f2,f3,f4) {
           if (k==1&&f1.checked) return true;
           if (k==2&&f2.checked) return true;
           if (k==3&&f3.checked) return true;
           if (k==4&&f4.checked) return true;
           return false;
           }
           
           function answer() {
           answ="";
                with(document)    {
               answ+=control(res.charAt(0) ,test.Q1[0],test.Q1[1])?"1":"0";
           answ+=control(res.charAt(1) ,test.Q2[0],test.Q2[1])?"1":"0";
           answ+=control(res.charAt(2) ,test.Q3[0],test.Q3[1])?"1":"0";
           answ+=control(res.charAt(3) ,test.Q4[0],test.Q4[1])?"1":"0";
           
           showResult();
               }
           }
            
           function showResult()   {
               var nok=0;
               var i,s;
            
           for (i=0; i<answ.length;i++) {nok+=answ.charAt(i)=="1"?1:0;}
           if(nok==4) s="ОТЛИЧНО";
           if(nok<4) s="ХОРОШО";
           if(nok<3) s="УДОВЛЕТВОРИТЕЛЬНО";
           if (nok<2) s="НЕУДОВЛЕТВОРИТЕЛЬНО";
               document.test.s1.
               value="Количество правильных ответов "+nok+". Ваша оценка "+s+".";
            
           with(document.test)
               {
               if (answ.charAt(0)=="1") {T1.value=" + "} else {T1.value=" - "};
              if (answ.charAt(1)=="1") {T2.value=" + "} else {T2.value=" - "};
              if (answ.charAt(2)=="1") {T3.value=" + "} else {T3.value=" - "};
              if (answ.charAt(3)=="1") {T4.value=" + "} else {T4.value=" - "};
                }
           }
           function showhide(obj){
               if(obj == 'none') return 'inline';
               else return 'none';
           }
           // ]]>
           </script>
           <center><b>Самопроверка</b></center>
            
           <div id="instruction" style="display: none; width: 100%;">
           <ul>
           <li>Выберите один из вариантов в каждом из 4 вопросов;</li>
           <li>Нажмите на кнопку "Показать результат";</li>
           <li>Скрипт не покажет результат, пока Вы не ответите на все вопросы;</li>
           <li>Загляните в окно рядом с номером задания. Если ответ правильный, то там (+). Если Вы ошиблись, там (-).</li>
           <li>За каждый правильный ответ начисляется 1 балл;</li>
           <li>Оценки: менее 2 баллов - НЕУДОВЛЕТВОРИТЕЛЬНО, от 2 но менее 3 - УДОВЛЕТВОРИТЕЛЬНО, 3 и менее 4 - ХОРОШО, 4 - ОТЛИЧНО;</li>
           <li>Чтобы сбросить результат тестирования, нажать кнопку "Сбросить ответы";</li>
           </ul>
           </div>
           <form name="test"><ol>
           <li><value="" name="T1"/><b> Выберите верное суждение</b><br/>
           <input type="radio" value="0" name="Q1"/> Моделирование — это метод познания, состоящий в создании и исследовании моделей. Теория замещения объектов-оригиналов объектом-моделью называется теорией моделирования.<br />
           <input type="radio" value="1" name="Q1"/> Модель не отображает существенные стороны объекта<br />
           <br/></li><li><b> Выберите верное понятие потенциальности</b><br/>
           <input type="radio" value="0" name="Q2"/> предсказуемость масштабов модели<br />
           <input type="radio" value="1" name="Q2"/> предсказуемость модели и ее свойств<br />
           <br/></li><li><b> Выберите классификацию моделей по цели использования</b><br/>
           <input type="radio" value="0" name="Q3"/> оптимизационные<br />
           <input type="radio" value="1" name="Q3"/> научно-технические<br />
           <br/></li><li><b> Укажите верное понятие модели</b><br/>
           <input type="radio" value="0" name="Q4"/> это некий новый объект, который отражает существенные особенности изучаемого объекта, явления или процесса<br />
           <input type="radio" value="1" name="Q4"/> это принципы формирования подразделений, делегирования полномочий и наделения ответственностью<br />
           <br/></li></ol>      
           <CENTER>
           <P><TEXTAREA name="s1" rows="4" cols="70" readonly> </TEXTAREA> </P>
           <INPUT onclick="check_me()" type="button" value="Показать результат"/>&nbsp;&nbsp;&nbsp;&nbsp; 
           <INPUT type="reset" value="Сбросить ответы"/> 
           </CENTER>        
           </form>
       
        </div>
      </div>
    </div>
  </div>
</div>

<script>
  document.addEventListener("DOMContentLoaded", function () {
    var scrollbar = document.body.clientWidth - window.innerWidth + 'px';
    console.log(scrollbar);
    document.querySelector('[href="#openModal"]').addEventListener('click', function () {
      document.body.style.overflow = 'hidden';
      document.querySelector('#openModal').style.marginLeft = scrollbar;
    });
    document.querySelector('[href="#close"]').addEventListener('click', function () {
      document.body.style.overflow = 'visible';
      document.querySelector('#openModal').style.marginLeft = '0px';
    });
  });
</script></p>
</div>


 <br>
<p align="center"><a href="./site.html" class="floating-button">Назад</a></p>
<p align="center"><a href="./lr2.html" class="floating-button">Тема 1.2.</a></p>


</body>
</html>